; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v1 ?v6)
		(pred_5 ?v3)
		(pred_4 ?v2)
		(pred_1 ?v2)
		(pred_2 ?v3 ?v2)
		(pred_6)
		(pred_3 ?v3))

   (:action op_2
       :parameters  (?v4 ?v7)
       :precondition (and (not-eq ?v4 ?v7) 
                          (pred_4 ?v4) (pred_4 ?v7) (pred_1 ?v4))
       :effect (and  (pred_1 ?v7)
		     (not (pred_1 ?v4))))


   (:action op_1
       :parameters (?v5 ?v8)
       :precondition  (and  (pred_5 ?v5) (pred_4 ?v8)
			    (pred_2 ?v5 ?v8) (pred_1 ?v8) (pred_6))
       :effect (and (pred_3 ?v5)
		    (not (pred_2 ?v5 ?v8)) 
		    (not (pred_6))))

   (:action op_3
       :parameters  (?v5  ?v8)
       :precondition  (and  (pred_5 ?v5) (pred_4 ?v8)
			    (pred_3 ?v5) (pred_1 ?v8))
       :effect (and (pred_2 ?v5 ?v8)
		    (pred_6)
		    (not (pred_3 ?v5)))))

; problem
(define (problem ferry-l6-c3)
(:domain ferry)
(:objects obj_03 obj_06 obj_01 obj_05 obj_07 obj_09 
          obj_02 obj_08 obj_04 
)
(:init
(pred_4 obj_03)
(pred_4 obj_06)
(pred_4 obj_01)
(pred_4 obj_05)
(pred_4 obj_07)
(pred_4 obj_09)
(pred_5 obj_02)
(pred_5 obj_08)
(pred_5 obj_04)
(not-eq obj_03 obj_06)
(not-eq obj_06 obj_03)
(not-eq obj_03 obj_01)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_05)
(not-eq obj_05 obj_03)
(not-eq obj_03 obj_07)
(not-eq obj_07 obj_03)
(not-eq obj_03 obj_09)
(not-eq obj_09 obj_03)
(not-eq obj_06 obj_01)
(not-eq obj_01 obj_06)
(not-eq obj_06 obj_05)
(not-eq obj_05 obj_06)
(not-eq obj_06 obj_07)
(not-eq obj_07 obj_06)
(not-eq obj_06 obj_09)
(not-eq obj_09 obj_06)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_01)
(not-eq obj_01 obj_07)
(not-eq obj_07 obj_01)
(not-eq obj_01 obj_09)
(not-eq obj_09 obj_01)
(not-eq obj_05 obj_07)
(not-eq obj_07 obj_05)
(not-eq obj_05 obj_09)
(not-eq obj_09 obj_05)
(not-eq obj_07 obj_09)
(not-eq obj_09 obj_07)
(pred_6)
(pred_2 obj_02 obj_09)
(pred_2 obj_08 obj_06)
(pred_2 obj_04 obj_03)
(pred_1 obj_01)
)
(:goal
(and
(pred_2 obj_02 obj_09)
(pred_2 obj_08 obj_06)
(pred_2 obj_04 obj_06)
)
)

(:constraints
  (sometime-before  (pred_2 obj_04 obj_06) (pred_1 obj_05))
)
)

; plan
1. (op_2 obj_01 obj_06)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_06)
   goals met: 2 of 3
2. (op_1 obj_08 obj_06)
   deleted: (pred_2 obj_08 obj_06) (pred_6)
   added: (pred_3 obj_08)
   goals met: 1 of 3
3. (op_2 obj_06 obj_05)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_05)
   goals met: 1 of 3
4. (op_3 obj_08 obj_05)
   deleted: (pred_3 obj_08)
   added: (pred_2 obj_08 obj_05) (pred_6)
   goals met: 1 of 3
5. (op_2 obj_05 obj_03)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_03)
   goals met: 1 of 3
6. (op_1 obj_04 obj_03)
   deleted: (pred_2 obj_04 obj_03) (pred_6)
   added: (pred_3 obj_04)
   goals met: 1 of 3
7. (op_2 obj_03 obj_06)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_06)
   goals met: 1 of 3
8. (op_3 obj_04 obj_06)
   deleted: (pred_3 obj_04)
   added: (pred_2 obj_04 obj_06) (pred_6)
   goals met: 2 of 3
9. (op_2 obj_06 obj_05)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_05)
   goals met: 2 of 3
10. (op_1 obj_08 obj_05)
   deleted: (pred_2 obj_08 obj_05) (pred_6)
   added: (pred_3 obj_08)
   goals met: 2 of 3
11. (op_2 obj_05 obj_06)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_06)
   goals met: 2 of 3
12. (op_3 obj_08 obj_06)
   deleted: (pred_3 obj_08)
   added: (pred_2 obj_08 obj_06) (pred_6)
   goals met: 3 of 3
